import type { FeatureFile } from 'utils/types';
import pickRandom from 'utils/pickRandom';

const pasta: any[] = [
  'Дико вибачаюс пробігала повз побачила ваш Стрім шо тут?  АХАХХААХ 🤣 мдааа 20+ років дівці сидить в чоловічків грає намальованих, я в твої роки уже 3х дітей народила)) ладно до зустрічі Задроти мдаа))))',
  'Однозначно, стрім не для тих кому менше 30-ти. Тут треба додумувати думки стрімера і просто мислити, а не плисти за течією трансляції. Відразу можна сказати, стрім важкий, швидше це драма. Сиджу і думаю, яке враження залишив стрімер... але точно зачепив. А це вже щось важить. Ця трансляція залишає післясмак. Абсолютно не шкода часу. Думаючий стрім для начитаних людей. Рекомендую!',
  'привіт красуня стрім супер гарний молодець',
  'розкішний стрім супер молодець',
  'Ладно,мацюська. Ти реально дуже красива і це без приколів. Бажаю тобі щастячька пупс. Гарного тобі перебуття на данній платформі і взагалі в цьому всесвіті. Самі тобі найкращі побажаннячька і цьомчік :3 Я просто захожу до таких гарних україночок і спілкуюсь інколи. Ладно гарного стрімчіку і щастячка в твою хатиночку',
  'ТИ ДИВИ! ТЬОЛКА! В НАКОЛКАХ ВСЯ! ТАКА МАЛА І ВЖЕ В НАКОЛКАХ! ТИ ДИВИ!',
  'Бляха, день тупо кайф, дивлюсь улюбленого стрімера, пиво в одній руці, цицька дружини -- в другій. Лежимо собі, дивимось, вона сучара іноді поперджує))) Пахне, бляха, якимось олів\'є))) Але нічого, мені норм, я чілю, адже мій улюблений стрімер грає в мою улюблену гру))',
  'Всі, хто хоче кидати курити, ОГОЛОШЕННЯ: доєднуйтеся до акції кидаємо курити з Сіреною_чан. В перший же день, коли починаєте кидати курити -- курите "останній раз". Далі кожен день, як собі захочете.',
  'А як домінос робить такі маленькі ніжки і крильця курячі? Вони що, вбивають маленьких курочок, поки вони ше маленькі?',
  'Жодного мату. 📌Краще не запитувати коли буде Пт, лекції в вашому місті. 📌Заборонено капс, спам. 📌Також не треба писати про уруру, лисичку і жабку. 📌Не просити передати привіт. 📌 Не вітає вас чи ще когось з днем народження, не просіть, аби вона це передала.📌Не переходимо на особистості. 📌Не пишіть занадто великі повідомлення. 📌Не тегаємо Сиреночку. Вона все читає та відповість, коли матиме час та бажання😌',
  'Гарна🥰українка😏я😁я😎танцюю🥵гопака😚гоп😅гоп🥸гопака😬я🤑танцюю👿гопака☠️',
  'Привіт мені тато забороняє тебе дивитися так як ти матюкаєшся і коли я починаю тебе дивитися він б\'є мене головою по клавіатулуаупорлкупгшрукгрКЦПИРУКПОРЛКУПКУццуир4373кор34рио899ауцр'
]
export const feature: FeatureFile = {

  onTimer: () => {
    return pickRandom(pasta);
  }
};
